{
  "backend/main.mo": "Motoko backend defining user profiles, transactions, notifications, and authorization‑protected methods for saving profiles, creating transactions, and fetching notifications.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, related components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining a warm color palette for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps pages in AuthGate for authenticated access.",
  "frontend/src/components/AppLayout.tsx": "Global layout with header, footer, navigation bar, and logout handling for authenticated users.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper that blocks content until Internet Identity login is completed.",
  "frontend/src/components/CameraErrorState.tsx": "Displays camera-related error messages with icons and a retry button, choosing content based on error type.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a user’s display name and phone number using Internet Identity and a save-profile mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, state management, and stored identity loading via a React context provider.",
  "frontend/src/hooks/useNotifications.ts": "Hooks to fetch user notifications and send or mark notifications as read using the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Hooks for retrieving and saving caller or other users’ profiles through the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Defines a mutation for creating transactions and invalidates notification queries after success.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables for light/dark themes and global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing navigation cards, unread notifications, and triggering profile setup if missing.",
  "frontend/src/pages/MyQRPage.tsx": "Displays the user's QR code using a custom canvas generator, loading profile data and rendering fallback states.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows user notifications with read/unread states and allows marking notifications as read.",
  "frontend/src/pages/ProfilePage.tsx": "Fetches and displays the user's profile details including name, phone, and QR code.",
  "frontend/src/pages/ReceiptPage.tsx": "Displays a mock payment receipt based on a transaction ID and provides navigation options.",
  "frontend/src/pages/ScanPayPage.tsx": "Scans a QR code, fetches recipient info, and submits a payment with optional notes.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows the user's transaction history, currently using placeholder empty-state logic.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params (including hash routing), persisting them in sessionStorage, and clearing them from storage or the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending typography, colors, fonts, animations, and container settings with added plugins.",
  "project_state.json": "Project metadata describing versions, requirements, features, architectural notes, issues, and image assets for a payments app."
}